content/post/my-reasons-for-blogging.md
+++
title = "My 5 reasons for blogging"
author = ["nori"]
date = 2023-12-14T18:39:00+01:00
tags = ["Online", "About me", "Knowledge work"]
categories = ["Knowledge work", "Blogging", "Learning", "Writing"]
draft = false
featured_image = "/img/featured_my-reasons-for-blogging.jpg"
f_alt = "An AI generated watercolor image of a platypus in front of a laptop."
+++

_(The image above is AI generated, the rest is not.)_

I believe this is my fifth(?!) attempt at blogging in the last 12 years. Some of those blogs were very short-lived, some survived for longer. None of the previous four are out there anymore. I had my reasons for starting each of the blogs, but it wasn't something I thought about much, not something that was clear in my mind. As I was starting yet another blog (this one), I decided to be a bit more mindful and conscious of what my goals actually are. Because if you don't know where you want to go, every step you take is in the wrong direction.

So here are my 5 reasons for blogging!


## 1. Sorting out my thoughts {#1-dot-sorting-out-my-thoughts}

I think a bunch. This is not a brag, by the way, I am not saying that I think more than others, and I am definitely not so certain this is good for me. But the fact is that I think enough for it to often get crowded in my head. For my sanity, it's pretty useful to get those things out.

David McCullough said "Writing is thinking," and I very much agree with that sentiment. Writing helps me sort out my thoughts. Somehow, it's the best way for me to even find out _what_ exactly I am thinking. In a way, I never quite know what will come out of it when I start, but that is one of its best benefits to me. It allows me to clarify my thoughts to myself.

While thinking itself can be passive, writing, on the other hand, is active. It gives the thoughts a concrete form, turns them from possibilities into _things_. Even if it's "only" words, those words are an act of creation.


## 2. Learning by explaining {#2-dot-learning-by-explaining}

Related to the previous point, explaining things, whether in writing or by talking through them, is one of the best ways to make sure that you understand things. Trying to put your knowledge into a digestible format that can be understood by others is one of the best ways to see where the gaps are, and it creates an incentive to fill them.

Richard Feynman was a big proponent of learning by trying to explain things to others It helped him finding out where he lacked knowledge, then he looked up what was missing, learned more and then did it all again. And again, and again. The Feynman technique (that is really what it is called) is just one of many within the "learning by teaching" framework. Even explaining things to an inanimate object improves learning, hence the existence of the "plastic platypus learning" technique (yes, that is its real name). (Now I kind of want a plastic platypus.)


## Note {#note}

One might argue, that these first two points only require writing, and maybe a plastic platypus, but can be done without plastering the writing all over the internet. And that is true. There are countless ways to achieve these goals, but I like blogging, because knowing others might read what I write forces me to write it with much more care than I would just for myself or for a plastic platypus, however cute.


## 3. Getting better at writing {#3-dot-getting-better-at-writing}

Does every teenager want to become a writer? I used to think so, then I asked a few people, and found out they don't. But I did. I also thought it was one of those silly dreams that you better not think too much about. How dumb is that?! Well, I finally got old enough and wise enough to realise that I might never be a _writer_, but there is nothing stopping me from being a writer. Nothing other than myself. Because making a living out of it is not at all required to being a writer.

As it is with any skill, be it pottery or skiing or coding or decorating cakes to look like real objects, you get better at it by doing it. Quantity leads to quality.

There is a story about a photography class in which the teacher told half of the students that they will be graded solely on the quantity of the photographs they take, while the other group was supposed to only take one single picture -- a culmination of their knowledge, planning and preparations. At the end of the course, all the best photographs came from the "quantity" group. Absolutely all of them.

I read this story first in Atomic Habits by James Clear, then again in Show Your Work! by Austin Kleon, but this time with pottery instead of photography. [Austin Kleon investigated why there are two versions of this story](https://austinkleon.com/2020/12/10/quantity-leads-to-quality-the-origin-of-a-parable/), and found out it really did happen in a photography class, but was first told by David Bayles and Ted Orland in the book Art &amp; Fear, and they felt it fit better when changed to pottery.

I feel like the story works perfectly well with both photography and pottery, and the two versions of it illustrate how universal it actually is. Quantity doesn't trump quality, but it does lead to it.

And so my goal is to practice my writing.


## 4. Gathering memories {#4-dot-gathering-memories}

This is a point I haven't reached yet. I have deleted my old blogs, although I do keep some of my favourite old articles in my own archives. But I am looking forward to one day browsing through things I wrote 5, 10 or 20 years ago. Reminding me how my life was back then, what I was thinking about. Some of it will definitely feel outdated, maybe even cringe, but I think it will be fun.


## 5. Connecting with other people {#5-dot-connecting-with-other-people}

Lastly, I want to publish my writings so that others can read them.

I often doubt whether my writing makes any sense, whether anyone wants to read it at all, whether I should just give up and climb under a rock. But life is too short and too weird for (self-)censorship, so I am doing my best to work around those doubts.

Truth is, I want people to read what I write. I want to know what they think. I want to test my ideas by showing them to others. I want to share the things I discovered, that make my life better or bring me join. I hope I might help someone, or inspire them, even if I only inspire them to prove me wrong on something.

Now that I am thinking about it, my blogging already turned a distant acquaintance into one of my now best friends. (Shoutout to Mariš!) I don't see where and how we would have gotten to know each other if I didn't step out of my comfort zone and started writing. So I guess it is working.


## What I didn't mention {#what-i-didn-t-mention}

An attentive reader might notice that I didn't talk about some things that many people nowadays aim for when starting a blog. There are no mentions of traffic, marketing, or growth. In short, no money.

Let's not sand-paper our eyes, who wouldn't want some extra money, right? (Btw, sand-papering your eyes is a great Slovak expression for denying the obvious. I am trying to introduce it to English. Is it working?) Anyway, yes, money.

Truth is, the last blog before this one was my attempt to start an online business. And I hated it. It was fun at first, then it wasn't. I wrote a whole [blog post about how I failed at starting an online business, and why I'm happy with that](https://noriparelius.com/post/i-failed-at-starting-an-online-business/). I still think it's super neat that people can make money online, and I definitely believe that creators should be paid for what they do and provide. But the way I was trying to go about it just didn't feel right for me.

Thankfully, I don't need to make money from blogging, and I have a bunch of other wonderful reason for pursuing it. I am very happy to just blog for fun, as a hobby, about whatever I want. Simply to enrich my life, and maybe, if I am lucky, someone else's too.
